In [63]:
import numpy as np 
import pandas as pd

In [64]:
 #Dataset One 
 data1 ={
    'id':[1,2,3],
    'Name':['Emon','Fatima','Ali'],
     'Age':[28,21,15]
 }
 df1 = pd.DataFrame(data1)

In [65]:
#Dataset Second 
data2 = {
    'id':[1,2,3],
    'City':['Chittagong','Ghujrawala','lahor'],
    'Ocupation':['AI Engineer','Madrasha Teacher','Student']
}
df2 = pd.DataFrame(data2)

In [66]:
#Merging Dataframes on id 
merged_df = pd.merge(df1,df2)

In [67]:
merged_df

   id    Name  Age        City         Ocupation
0   1    Emon   28  Chittagong       AI Engineer
1   2  Fatima   21  Ghujrawala  Madrasha Teacher
2   3     Ali   15       lahor           Student

Concatanations

In [68]:
import pandas as pd

In [69]:
data1 = {'Name':['Emon','Shajeza','Erfat'], 'Age':[28,20,15]}
data2 = {'Name':['Sara','Usman','Aisha'], 'Age':[29,35,27]}
data3 = {'City':['Karachi','Lahore','Islamabad'],'Province':['Sindh','Punjab','Ghujrawala']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [70]:
concate_rows = pd.concat([df1,df2])

In [71]:
concate_rows

      Name  Age
0     Emon   28
1  Shajeza   20
2    Erfat   15
0     Sara   29
1    Usman   35
2    Aisha   27

In [86]:
concate_col = pd.concat([df1,df3],axis = 1)

In [87]:
concate_rows

      Name  Age
0     Emon   28
1  Shajeza   20
2    Erfat   15
0     Sara   29
1    Usman   35
2    Aisha   27

In [88]:
concate_col

      Name  Age       City    Province
0     Emon   28    Karachi       Sindh
1  Shajeza   20     Lahore      Punjab
2    Erfat   15  Islamabad  Ghujrawala